nc: 10  # 类别数

backbone:
  # 初始卷积：输入1通道，输出32通道，卷积核3，步长1，填充1
  - [-1, 1, Conv, [32, 3, 1, 1]]        # 0: 32x28x28
  # 最大池化 2x2
  - [-1, 1, MaxPool, [2, 2]]             # 1: 32x14x14
  # 卷积 32->64, 3x3, 步长1, 填充1
  - [-1, 1, Conv, [64, 3, 1, 1]]         # 2: 64x14x14
  # 最大池化 2x2
  - [-1, 1, MaxPool, [2, 2]]             # 3: 64x7x7
  # C3模块（CSP瓶颈层），输入64，输出64，内部bottleneck数1
  - [-1, 1, C3, [64, 1]]                 # 4: 64x7x7
  # 全局平均池化，输出尺寸1x1
  - [-1, 1, AdaptiveAvgPool2d, [1]]      # 5: 64x1x1

# 分类头（全连接部分）
head:
  - [-1, 1, Dropout, [0.5]]              # 6: Dropout
  - [-1, 1, Linear, [10]]                 # 7: 全连接层，输入64 -> 输出10